import pandas as pd
import pytest


@pytest.fixture
def sample_transactions():
    data = {
        "Дата операции": ["01.01.2023 10:00:00", "02.01.2023 12:30:00", "12.03.2023 11:30:00"],
        "Сумма операции": [-100, -200, -300],
        "Сумма операции с округлением": [100, 200, 300],
        "Категория": ["Супермаркеты", "Переводы", "Аптека"],
        "Номер карты": ["*1111", "*1111", "*1111"],
        "Описание": ["Avito", "Магазин у дома", "Парикмахерская"]
    }
    df = pd.DataFrame(data)
    return df


@pytest.fixture
def data_people():
    data = [
        {
            "Дата операции": "01.01.2018 20:27:51",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -316.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -316.0,
            "Валюта платежа": "RUB",
            "Категория": "Красота",
            "Описание": "OOO Balid",
        },
        {
            "Дата операции": "01.01.2018 12:49:53",
            "Номер карты": None,
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -3000.0,
            "Валюта платежа": "RUB",
            "Категория": "Переводы",
            "Описание": "Линзомат ТЦ Юность",
        },
        {
            "Дата операции": "05.09.2020 13:51:12",
            "Номер карты": None,
            "Статус": "OK",
            "Сумма операции": -88.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -88.0,
            "Валюта платежа": "RUB",
            "Категория": "Переводы",
            "Описание": "Валерий А.",
        },
    ]
    return data


@pytest.fixture
def sample_transact():
    data = {
        "Дата платежа": ["01.01.2023 10:00:00", "02.01.2023 12:30:00", "12.03.2023 11:30:00"],
        "Сумма операции": [-100, -200, -300],
        "Сумма операции с округлением": [100, 200, 300],
        "Категория": ["Супермаркеты", "Переводы", "Аптека"],
        "Номер карты": ["*1111", "*1111", "*3322"],
        "Описание": ["Avito", "Магазин у дома", "Парикмахерская"]
    }
    df = pd.DataFrame(data)
    return df
